app/controllers/products_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def load_prodct
    @product = Product.find_by(id: params[:id])