app/controllers/warehouses_controller.rb

INSERT INTO "warehouses" ("wh_code", "name", "pincode", "max_apacity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["wh_code", "MUMBAI004"], ["name", "Mumbai"], ["pincode", 421004], ["max_apacity", 200], ["created_at", "2020-06-25 07:05:39.061582"], ["updated_at", "2020-06-25 07:05:39.061582"]]
---
  def create
    @warehouse = Warehouse.new(warehouse_params)
    if @warehouse.save